@echo off
chcp 65001 > NUL
mode con cols=120 lines=30
title=ADB COPY
::color B0
color 20
echo Starting ... 启动中 ...

if '%1'=='' (
echo .  将需要拷贝的文件拖放到这个批处理上面  .
goto exit
)

set TF_ROOT=/rsdcard
set TEMP_FILE=adb_push_temp.tmp

set FILENAME=%~n1%~x1 

echo.
echo ==================================================
echo . 即将拷贝《%FILENAME%》文件到 TF卡根目录  ...
echo ==================================================
echo . 本批处理脚本解决了（绕开了）                   .
echo . 直接adb push无法传输中文文件名文件的问题       .
echo --------------------------------------------------
echo.
echo.
echo ------------------------------------------------------------
echo . 尝试列出安卓设备 ...                                     .
echo ------------------------------------------------------------
echo.

adb devices

echo.
echo ------------------------------------------------------------
echo . 如果上面没有成功列出正确的安卓设备，                     .
echo . 请一定 直接关闭本窗口 退出！                             .
echo ------------------------------------------------------------
echo.
echo.

pause

echo.
echo ------------------------------------------------------------
echo . 开始传输apk并安装，请稍候                                .
echo ------------------------------------------------------------
echo.






echo *** 开始传输 "%1" ，请稍后 ...

adb push %1 %TF_ROOT%/%TEMP_FILE%


echo *** 传输完毕，请稍后 ...

adb shell "mv %TF_ROOT%/%TEMP_FILE% %TF_ROOT%/'%FILENAME%'"


echo.
echo ==================================================
echo . 拷贝完成！   按任意键退出，或直接关闭窗口。    .
echo ==================================================
echo.

:exit

pause

::EOF